In [1]:
import pandas as pd

In [2]:
sal = pd.read_csv("Salaries.csv")
teams = pd.read_csv("Teams.csv")

In [3]:
print('Teams years: ',teams.yearID.min(), teams.yearID.max())
print('Salaries years:', sal.yearID.min(),sal.yearID.max())

Teams years:  1871 2015
Salaries years: 1985 2015

Esto significa que nuestro analisis debe ser de 1985 a 2015, donde los dos coinciden

In [4]:
tm = teams[(teams['yearID']>1984)]
tm.reset_index(inplace=True, drop=True)
tm = tm[['teamID', 'W', 'G', 'yearID']]
tm.head()

  teamID   W    G  yearID
0    ATL  66  162    1985
1    BAL  83  161    1985
2    BOS  81  163    1985
3    CAL  90  162    1985
4    CHA  85  163    1985

Checamos si hay nombres de equipos distintos en cada año (al parecer no).

In [5]:
for y in range(1985, 2016):
    if sorted(sal[sal['yearID']==y]['teamID'].unique().tolist())!=sorted(tm[tm['yearID']==y]['teamID'].unique().tolist()):
        print('NOOOO')

Promedio de salarios por año

In [6]:
tm['salary_mean_per_year'] = tm.apply(lambda x: sal[(sal['yearID']==x['yearID']) & (sal['teamID']==x['teamID'])]['salary'].mean(), axis=1)

Sacamos el porcetaje de juegos ganados por equipo y creamos un nuevo data frame con columnas:
`teamID`,`Porcentaje Wins`,`Salarios promedio`

In [7]:
df = pd.DataFrame(columns=['teamID', 'PJG', 'Salario_prom'])
df['teamID'] = tm[tm['yearID']==y]['teamID'].unique().tolist()
df['PJG'] = df['teamID'].apply(lambda x: round((tm[tm['teamID']==x]['W'].sum()/tm[tm['teamID']==x]['G'].sum())*100,2))
df['Salario_prom'] = df['teamID'].apply(lambda x: round(tm[tm['teamID']==x]['salary_mean_per_year'].mean(),2))
df.head()

  teamID    PJG  Salario_prom
0    KCA  46.52    1470645.59
1    MIN  48.98    1662150.06
2    CLE  49.87    1648258.28
3    CHA  50.67    2146572.04
4    DET  47.80    2306922.91

In [8]:
# df.to_csv('salarios_pjg.csv', index=False)